In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
datos = sns.load_dataset('titanic')
datos

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
datos.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [5]:
datos.drop('embarked', axis=1, inplace=True)
datos.drop('class', axis=1, inplace=True)
datos.drop('who', axis=1, inplace=True)
datos.drop('adult_male', axis=1, inplace=True)
datos.drop('deck', axis=1, inplace=True)
datos.drop('embark_town', axis=1, inplace=True)
datos.drop('alive', axis=1, inplace=True)
datos.drop('alone', axis=1, inplace=True)
datos

     survived  pclass     sex   age  sibsp  parch     fare
0           0       3    male  22.0      1      0   7.2500
1           1       1  female  38.0      1      0  71.2833
2           1       3  female  26.0      0      0   7.9250
3           1       1  female  35.0      1      0  53.1000
4           0       3    male  35.0      0      0   8.0500
..        ...     ...     ...   ...    ...    ...      ...
886         0       2    male  27.0      0      0  13.0000
887         1       1  female  19.0      0      0  30.0000
888         0       3  female   NaN      1      2  23.4500
889         1       1    male  26.0      0      0  30.0000
890         0       3    male  32.0      0      0   7.7500

[891 rows x 7 columns]

In [6]:
from sklearn.preprocessing import LabelEncoder
codificador = LabelEncoder()
datos['sex'] = codificador.fit_transform(datos['sex'])
datos

     survived  pclass  sex   age  sibsp  parch     fare
0           0       3    1  22.0      1      0   7.2500
1           1       1    0  38.0      1      0  71.2833
2           1       3    0  26.0      0      0   7.9250
3           1       1    0  35.0      1      0  53.1000
4           0       3    1  35.0      0      0   8.0500
..        ...     ...  ...   ...    ...    ...      ...
886         0       2    1  27.0      0      0  13.0000
887         1       1    0  19.0      0      0  30.0000
888         0       3    0   NaN      1      2  23.4500
889         1       1    1  26.0      0      0  30.0000
890         0       3    1  32.0      0      0   7.7500

[891 rows x 7 columns]

In [7]:
copiaDatos = datos.copy()

In [8]:
# Dividir el conjunto en X (explicativas) y Y (respuesta)
y = datos['survived']
datos.drop('survived', axis=1, inplace=True)
datos

     pclass  sex   age  sibsp  parch     fare
0         3    1  22.0      1      0   7.2500
1         1    0  38.0      1      0  71.2833
2         3    0  26.0      0      0   7.9250
3         1    0  35.0      1      0  53.1000
4         3    1  35.0      0      0   8.0500
..      ...  ...   ...    ...    ...      ...
886       2    1  27.0      0      0  13.0000
887       1    0  19.0      0      0  30.0000
888       3    0   NaN      1      2  23.4500
889       1    1  26.0      0      0  30.0000
890       3    1  32.0      0      0   7.7500

[891 rows x 6 columns]

In [9]:
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  891 non-null    int64
 1   sex     891 non-null    int64
 2   age     714 non-null    float64
 3   sibsp   891 non-null    int64
 4   parch   891 non-null    int64
 5   fare    891 non-null    float64
dtypes: float64(2), int64(4)
memory usage: 41.9 KB

In [10]:
print(datos.isnull().sum())

pclass      0
sex         0
age       177
sibsp       0
parch       0
fare        0
dtype: int64

In [11]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(datos, y , test_size=0.3, random_state=50)

In [12]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()

In [13]:
# lr.fit(x_train, y_train)

## Eliminar columna con valores faltantes

In [14]:
datosActualizados = datos.dropna(axis=1)
datosActualizados

     pclass  sex  sibsp  parch     fare
0         3    1      1      0   7.2500
1         1    0      1      0  71.2833
2         3    0      0      0   7.9250
3         1    0      1      0  53.1000
4         3    1      0      0   8.0500
..      ...  ...    ...    ...      ...
886       2    1      0      0  13.0000
887       1    0      0      0  30.0000
888       3    0      1      2  23.4500
889       1    1      0      0  30.0000
890       3    1      0      0   7.7500

[891 rows x 5 columns]

In [15]:
x_train, x_test, y_train, y_test = train_test_split(datosActualizados, y , test_size=0.3, random_state=50)
lr.fit(x_train, y_train)
pred = lr.predict(x_test)
pred

array([1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1,
       1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0])

In [16]:
from sklearn import metrics
print(metrics.accuracy_score(pred, y_test))

0.7985074626865671

### Rellenar datos faltantes - Imputar

Imputar con:
- **Media**: Promedio de los datos (se ve afectada por valores extremo)
- **Mediana:** Valor que se encuentra justamente en la posición central de la serie de datos ordenada
- **Moda:** El mas frecuente (puede ser unimodal, bimodal, multimodal o no haber moda)

In [17]:
datosRelleno = copiaDatos.copy()
datosRelleno['age'] = datosRelleno['age'].fillna(datosRelleno['age'].mean())
datosRelleno.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    int64
 3   age       891 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

In [18]:
# Segmentar los grupos en entrenamiento y pruebas
y = datosRelleno['survived']
datosRelleno.drop('survived', axis=1, inplace=True)
x_train, x_test, y_train, y_test = train_test_split(datosRelleno, y, test_size=0.3, random_state=50)
lr.fit(x_train, y_train)
pred = lr.predict(x_test)
print(metrics.accuracy_score(pred, y_test));

0.8097014925373134

#### Otras formas de imputación
- Interpolación lineal
- Rellenar con el dato de la siguiente fila
- Agregar una columna

In [19]:
imputados = copiaDatos.copy()
imputados['ageMissing'] = imputados['age'].isnull()
imputados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   sex         891 non-null    int64
 3   age         714 non-null    float64
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    float64
 7   ageMissing  891 non-null    bool
dtypes: bool(1), float64(2), int64(5)
memory usage: 49.7 KB

In [20]:
from sklearn.impute import SimpleImputer

In [21]:
# Segmentar los grupos en entrenamiento y pruebas
y = imputados['survived']
imputados.drop('survived', axis=1, inplace=True)

In [22]:
imputador = SimpleImputer(strategy='median')
nuevosDatos = imputador.fit_transform(imputados)

In [23]:
print('Imputados (primeras 5 lineas)')
print(nuevosDatos[:5])

Imputados (primeras 5 lineas)
[[ 3.      1.     22.      1.      0.      7.25    0.    ]
 [ 1.      0.     38.      1.      0.     71.2833  0.    ]
 [ 3.      0.     26.      0.      0.      7.925   0.    ]
 [ 1.      0.     35.      1.      0.     53.1     0.    ]
 [ 3.      1.     35.      0.      0.      8.05    0.    ]]

In [24]:
columnas = imputados.columns
imputados = pd.DataFrame(nuevosDatos, columns=columnas)
imputados

     pclass  sex   age  sibsp  parch     fare  ageMissing
0       3.0  1.0  22.0    1.0    0.0   7.2500         0.0
1       1.0  0.0  38.0    1.0    0.0  71.2833         0.0
2       3.0  0.0  26.0    0.0    0.0   7.9250         0.0
3       1.0  0.0  35.0    1.0    0.0  53.1000         0.0
4       3.0  1.0  35.0    0.0    0.0   8.0500         0.0
..      ...  ...   ...    ...    ...      ...         ...
886     2.0  1.0  27.0    0.0    0.0  13.0000         0.0
887     1.0  0.0  19.0    0.0    0.0  30.0000         0.0
888     3.0  0.0  28.0    1.0    2.0  23.4500         1.0
889     1.0  1.0  26.0    0.0    0.0  30.0000         0.0
890     3.0  1.0  32.0    0.0    0.0   7.7500         0.0

[891 rows x 7 columns]

In [25]:
# Segmentar los grupos en entrenamiento y pruebas
x_train, x_test, y_train, y_test = train_test_split(imputados, y, test_size=0.3, random_state=50)
lr.fit(x_train, y_train)
pred = lr.predict(x_test)
print(metrics.accuracy_score(pred, y_test));

0.8097014925373134

In [26]:
imputados['ageMissing'] = imputados['ageMissing'].astype('bool')
imputados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   pclass      891 non-null    float64
 1   sex         891 non-null    float64
 2   age         891 non-null    float64
 3   sibsp       891 non-null    float64
 4   parch       891 non-null    float64
 5   fare        891 non-null    float64
 6   ageMissing  891 non-null    bool
dtypes: bool(1), float64(6)
memory usage: 42.8 KB

In [27]:
# Segmentar los grupos en entrenamiento y pruebas
x_train, x_test, y_train, y_test = train_test_split(imputados, y, test_size=0.3, random_state=50)
lr.fit(x_train, y_train)
pred = lr.predict(x_test)
print(metrics.accuracy_score(pred, y_test));

0.8097014925373134

In [28]:
from sklearn.linear_model import LinearRegression

In [29]:
testDatos = copiaDatos[copiaDatos['age'].isnull() == True]
trainDatos = copiaDatos[copiaDatos['age'].isnull() == False]
y = trainDatos['age']
trainDatos.drop('age', axis=1, inplace=True)
lr = LinearRegression()
lr.fit(trainDatos, y)
testDatos.drop('age', axis=1, inplace=True)
estimada = lr.predict(testDatos)
testDatos['age'] = estimada
testDatos

C:\Users\medin\AppData\Local\Temp\ipykernel_12572\1661710918.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  trainDatos.drop('age', axis=1, inplace=True)
C:\Users\medin\AppData\Local\Temp\ipykernel_12572\1661710918.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  testDatos.drop('age', axis=1, inplace=True)
C:\Users\medin\AppData\Local\Temp\ipykernel_12572\1661710918.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  testDatos['age'] = estimada

     survived  pclass  sex  sibsp  parch     fare        age
5           0       3    1      0      0   8.4583  29.070801
17          1       2    1      0      0  13.0000  30.108333
19          1       3    0      0      0   7.2250  22.446851
26          0       3    1      0      0   7.2250  29.089273
28          1       3    0      0      0   7.8792  22.437052
..        ...     ...  ...    ...    ...      ...        ...
859         0       3    1      0      0   7.2292  29.089211
863         0       3    0      8      2  69.5500  -5.201268
868         0       3    1      0      0   9.5000  29.055198
878         0       3    1      0      0   7.8958  29.079226
888         0       3    0      1      2  23.4500  23.494303

[177 rows x 7 columns]

### Detección de valores atipicos utilizando el rango intercuartil (RIC)

$RIC = Q_3 - Q_1$

$L_i = Q_1 - 1.5 X RIC$

$L_s = Q_3 + 1.5 X RIC$

In [30]:
outliers = []

In [34]:
def detectar_outliers_ric(datos):
    datos = sorted(datos)
    q1 = np.quantile(datos, 0.25)
    q3 = np.quantile(datos, 0.75)
    ric = q3 - q1
    li = q1 - 1.5*ric
    ls = q3 + 1.5*ric
    print(f'Limite inferior: {li}; limite superior: {ls}')
    for valor in datos:
        if (valor < li or valor > ls):
            outliers.append(valor)
    return outliers

In [35]:
extremos = detectar_outliers_ric(muestra)
print('valores atipicos:', extremos)

NameError: name 'muestra' is not defined